<!DOCTYPE html>
<html lang="ru">
  <head>
    <title>Играть Deeeep.io | WorldPlay</title>
    <?php
      include "../src/settings/game/game__head.php";
    ?>
  </head>
  <body>
    <?php
      include "../src/settings/preloader.php";
    ?>
    <div class="wrapper">
      <header>
        <?php
          include "../src/settings/game/game__header.php";
        ?>
      </header>
      <main>
        <section>
          <div class="play">
            <div class="play__container">
              <div class="play__item">
                <div class="play__value" title="Оценка">
                  <p>7.8</p>
                </div>
                <div class="play__name">
                  <p>Deeeep.io</p>
                </div>
                <a href="../io/deeeep" target="_blank">
                  <?php
                    include "../src/settings/game/play_white.php";
                  ?>
                </a>
              </div>
              <div class="play__blockcontainer">
                <div class="play__block">
                  <div class="play__iframe">
                    <iframe src="../io/deeeep"></iframe>
                  </div>
                </div>
                <div class="play__iogame">
                  <img src="https://cdn.worldplay.tk/cdn/images/icon_deeeep.io.webp" alt="">
                  <ul>
                    <li><span class="white">Разработчик:</span> Ouwi!</li>
                    <li><span class="white">Издатель:</span> Ouwi!, Федерико Маус, Avor Games</li>
                    <li><span class="white">Дата выпуска:</span> 9 ноября 2016 г.</li>
                    <li><span class="white">Жанры:</span> Симулятор, Ролевые</li>
                    <li><span class="white">Платформы:</span> Браузер, iOS, Windows</li>
                    <li><span class="white">Режим игры:</span> Сетевая игра</li>
                    <li><span class="white">Язык интерфейса:</span> Английский</li>
                    <li><span class="white">Альтернативные названия:</span> глубина ио, dep io, deep io, deeep io, диип ио, дииип ио, дееп ио, деееп ио</li>
                  </ul>
                </div>
              </div>
              <div class="play__content">
                <div class="play__info">
                  <p>Об игре</p>
                </div>
                <div class="play__text">
                  <p>В Deeeep.io мы начинаем с малька, кушаем зеленый планктон в океане и растём, приобретая разные полезные для выживания и охоты навыки.</p>
                  <img src="https://cdn.worldplay.tk/cdn/game/deeeep.io.webp" alt="" />
                </div>
                <div class="play__info">
                  <p>Как играть</p>
                </div>
                <div class="play__text column">
                  <p>Основная задача в Deeeep.io — стать самым большим и сильным зверем в игре. Девиз игры так и звучит: "ешь рыбу, становись акулой!". Поначалу придётся питаться планктоном и омертвелой органикой, которая в изобилии сыплется на дно. Зато со временем и ростом ваш персонаж мутирует в более крупных животных, которые могут питаться и другими игроками. Но даже став самой большой акулой, не стоит расслабляться. Более слабый противник может напасть со спины и даже съесть.<br/>Одна из изюминок Deeeep.io в том, что в море, где предстоит жить, существуют зоны с разным давлением. Животные, изначально рожденные в тёмных глубинах, будут терять давление, если вздумают забраться выше. Поначалу это не смертельно, но только поначалу. Животным, кто родился на небольшой глубине, вниз лучше не спускаться. Также ни одной из рыб не стоит надолго задерживаться на поверхности — на островах. Запас кислорода исчерпывается еще быстрее, чем запас нормального давления.<br/>Deeeep.io — это настоящая битва рыб, где атака лоб в лоб даёт равные потери игрокам при равных уровнях. Здесь лучше нападать сзади; так можно поразить даже более сильного противника. Но все равно, на слишком сильно здорового соперника нападать не стоит.<br/>Каждая рыба обладает своими специальными умениями для того, чтобы выживать в опасной среде. Постепенно вы поймёте, что умеют разные существа и как их использовать, а так же и то, что стоит ожидать от соперников.<br/>Чтобы получше понять способности разных рыб в Deeeep.io, вы можете посмотреть серию роликов, которые находятся в колонке новости слева по центру. Там так же есть видео с расшифровкой дерева превращений. Оно будет полезно, чтобы понять, какие апгрейды вам необходимо делать, чтобы достичь определенного животного. Впрочем, через пару часов игры вы и сами сможете разбираться в Deeeep.io на уровне профессионала.<br/>Отдельного слова достойны режимы в Deeeep.io. Доступно 5 игровых режимов, сменить которые можно на главной странице в самом верху по центру. Некоторые из них требуют большого количества участников и запускаются только тогда, когда наберется достаточное количество игроков. До того времени все игроки сидят в общем чате и ждут.
                  <ol>
                    <li>1 на 1. Вам подыскивается соперник, с которым вы бьетесь до победного.</li>
                    <li>Жемчужина. Это классический "захват флага", где нужно разрушить скорлупку у вражеской жемчужины, а потом схватить сокровище и принести его к себе на базу.</li>
                    <li>Последний выживший (Lastman mode). Здесь море постепенно заражается и зона, в которой можно обитать, сужается. Последний, кто останется в живых - победитель.</li>
                    <li>FFA. Мод, где каждый сам за себя.</li>
                    <li>FFA в изначальной версии игры.</li>
                  </ol></p>
                </div>
                <div class="play__info">
                  <p>Управление</p>
                </div>
                <div class="play__text">
                  <ul>
                    <li>Движется животное за курсором</li>
                    <li>Клик чтобы сделать рывок</li>
                    <li>М чтобы показать/скрыть чат</li>
                    <li>ESC чтобы показать/скрыть главное меню</li>
                  </ul>
                </div>
              </div>
            </div>
          </div>
        </section>
        <article>
          <?php
            include "../src/settings/game/game__nav.php";
          ?>
        </article>
        <article>
          <?php
            include "../src/settings/game/game__aside.php";
          ?>
        </article>
      </main>
      <footer>
        <?php
          include "../src/settings/game/game__footer.php";
        ?>
      </footer>
    </div>
    <?php
      include "../src/settings/game/game__script.php";
    ?>
  </body>
</html>