<!DOCTYPE html>
<html lang="ru">
  <head>
    <title>Играть Diep.io | WorldPlay</title>
    <?php
      include "../src/settings/game/game__head.php";
    ?>
  </head>
  <body>
    <?php
      include "../src/settings/preloader.php";
    ?>
    <div class="wrapper">
      <header>
        <?php
          include "../src/settings/game/game__header.php";
        ?>
      </header>
      <main>
        <section>
          <div class="play">
            <div class="play__container">
              <div class="play__item">
                <div class="play__value bgreen" title="Оценка">
                  <p>8.5</p>
                </div>
                <div class="play__name">
                  <p>Diep.io</p>
                </div>
                <a href="../io/diep" target="_blank">
                  <?php
                    include "../src/settings/game/play_green.php";
                  ?>
                </a>
              </div>
              <div class="play__blockcontainer">
                <div class="play__block">
                  <div class="play__iframe">
                    <p>К сожалению, данная игра не позволяет установить соединение</p>
                  </div>
                </div>
                <div class="play__iogame">
                  <img src="https://cdn.worldplay.tk/cdn/images/icon_diep.io.webp" alt="">
                  <ul>
                    <li><span class="green">Разработчик:</span> Матеус Валадарес</li>
                    <li><span class="green">Издатель:</span> Матеус Валадарес, Miniclip, Crazy IO Games</li>
                    <li><span class="green">Дата выпуска:</span> 2016 год</li>
                    <li><span class="green">Жанры:</span> Экшен, Стратегия, Путешествия</li>
                    <li><span class="green">Платформы:</span> Браузер, Android, Windows</li>
                    <li><span class="green">Режим игры:</span> Сетевая игра</li>
                    <li><span class="green">Язык интерфейса:</span> Английский</li>
                    <li><span class="green">Альтернативные названия:</span> дипио, дип ио, дип ио играть</li>
                  </ul>
                </div>
              </div>
              <div class="play__content">
                <div class="play__info">
                  <p>Об игре</p>
                </div>
                <div class="play__text">
                  <p>Здесь вы проведете немало часов, потому что Diep.io —  это мега-игра. Посмотрите на свои руки. Вот эти руки сейчас будут рулить мощнейшим оружием, какое только смогут создать.</p>
                  <img src="https://cdn.worldplay.tk/cdn/game/diep.io.webp" alt="" />
                </div>
                <div class="play__info">
                  <p>Как играть</p>
                </div>
                <div class="play__text">
                  <p>Максимальный уровень прокачки Танка - 45. Качается довольно быстро, минут за 10-15. Так же у Танка есть три апгрейда, во время которых он получает специализацию. Качаться будете за счёт разрушения желтых, красных и фиолетовых фигур, а также других танков.</p>
                </div>
                <div class="play__info">
                  <p>Управление</p>
                </div>
                <div class="play__text">
                  <span>Управление в Diep.io WASD (стрелками) + мышь. Если нажать E, то стрельба будет автоматической.</span>
                </div>
                <div class="play__info">
                  <p>Условия победы и поражения</p>
                </div>
                <div class="play__text">
                  <span>Победа и поражение в Diep.io зависят от того, в каком режиме вы играете. Есть режимы конечные и бесконечные. Для начала —  о конечных.
В режиме Domination выигрывает команда, захватившая все 4 точки на карте. Режим Survival играется до последнего выжившего на карте.<br/>В остальных режимах играть на карте можно бесконечно, как и удерживать лидерство в Топе. Единственное, когда вы занимаете 1-е место, то серая стрелка в левом нижнем углу экрана будет указывать в вашу сторону, так что будьте осторожны.<br/>Поражение как таковое отсутствует. Когда вас убивают, то вы перерождаетесь с потерей характеристик, а прокачка характеристик и вида танка обнуляется. Иногда это даже здорово, так как можно попробовать раскачаться по-другому.</span>
                </div>
                <div class="play__info">
                  <p>Прокачка</p>
                </div>
                <div class="play__text">
                  <span>Все танки хороши, все виды нам нужны. Нет такого, чтобы вот прокачался и никто тебе нигде. В задачу игрока входит найти тот танк, которым ему удобнее и приятнее и интереснее сегодня играть. Завтра это будет другой танк, послезавтра - третий. А через неделю опять покажется, что первая прокачка все же круче всего. Это нормально. Просто можно загонять себя тем, чтобы искать совершенный билд, а можно находить плюсы и наслаждаться игрой за каждый из билдов.<br/>Такой танк не нарисован здесь, но вы видели круглый танк без пушек, с острыми шипами. Возникает вопрос, а как такое сочинить?
Ответ - чтобы взять такой класс, вам нужно проигнорировать первый апгрейд. Тогда на 30м уровне вам предложал взять Колобка.<br/>И бонусом ответ на вопрос "а сохранятся апгрейды, которые я проигнорировал или пропадут?" Ответ - сохранятся. Если вы проигнорировали и первый апгрейд и второй, то на 45м уровне вы можете сразу прокачаться до любого танка.<br/>Есть определенная логика в том, как раскачивать вид танка + характеристики. В графе "Хаки, Нюансы, Рекомендации", мы приведем несколько не очевидных примеров прокачки.
От 9‑го марта 2017 появилось обновление игры, связанное с характеристиками. Теперь, зажав U вы можете создать очередь того, как будут автоматически прокачиваться характеристики на полученные очки. План такой: зажимаете U и кликаете на плюсики. Как только вам начисляться характеристики, они прокачаются в указанном порядке. Это значит, что если нажать максимально Урон, потом Перезарядку, потом довести до максимума Скорость пули, то вначале вы будете все вкладывать в Урон и т.д. То есть разумно один плюсик на 7, другой на 6, на 5 и на 4, потом снова на 7, на 6 на 5 - так прокачка будет гармоничной. Режим очереди позволяет прокачиваться, не отвлекаясь от боя, хотя опытным танкистам это не проблема =)<br/>Если вы зажмете M, то кликом на характеристику заранее заложите в план все до максимума. Чтобы убрать очередь, надо, продолжая держать M, нажать 1 раз на U. На наш взгляд, тут немного перемудрили и мы советуем сделать так как написали выше: нажать U и по одному разику вразнобой покликать на статы.</span>
                </div>
                <div class="play__info">
                  <p>Режимы</p>
                </div>
                <div class="play__text">
                  <ul>
                    <li><b>FFA</b> — Каждый сам за себя.</li>
                    <li><b>2 Teams</b> — Здесь 2 команды и ваш успех равен успеху вашей команды.</li>
                    <li><b>4 Teams</b> — Есть 4 команды. На доске лидерства отмечаются ваши персональные успехи и отмечается, какого вы цвета.</li>
                    <li><b>Domination</b> — "Захват флага". Есть 2 команды и 4 квадрата в центре. Игра заканчивается, когда одна из команд захватила все четыре точки.</li>
                    <li><b>Tag</b> — Здесь личные амбиции идут на пользу команде. 4 цвета, 4 команды; задача вывести свою команду в Топ.</li>
                    <li><b>Maze</b> — Лабиринт. Каждый сам за себя, но при этом бегаете по переулкам и тупикам.</li>
                    <li><b>Survival</b> — Игра, длиною в жизнь! В одну. Здесь играется до победного - как только вас убили, вы вылетаете. Останется только один.</li>
                    <li><b>Sandbox</b> — Это песочница. Вы там один, и качаетесь в своё здоровье потихоньку. Опыт показывает, что в боевых условиях вы прокачиваетесь куда более стремительно и возможность увидеть 45й уровень наступит скорее =)</li>
                  </ul>
                </div>
              </div>
              <div class="play__info">
                <p>Рекомендации</p>
              </div>
              <div class="play__text">
                <ul>Попробуйте сделать вот что:
<li>Вложиться в статы 3,2,1 и прокачаться до Аннигилятора (танк с гигантской пушкой). Когда такой танк стреляет, его отбрасывает назад, так? Так вот. Оборачиваетесь задом по направлению у противнику, используете стрельбу как ускорение и задавливаете всех массой.</li>
<li>Прокачайтесь до Booster, развейте на полную 5, 6, 7, 8 и оставшиеся статы на 4. Получается, у вас скорость стрельбы не будет хватать 2 плюсов до максимума. И это прикол: вы будете так быстро летать по карте, что патроны будут скапливаться впереди. А когда вы нагоните соперника, все это облако пуль уничтожит его враз.</li>
<li>Зайдите с другом на карту и оба прокачайтесь до Penta Shot. Такой шквал огня выдержать нереально никому. Даже пули снайпера не смогут пробиться.</li>
                </ul>
              </div>
              <div class="play__info">
                <p>Моды</p>
              </div>
              <div class="play__text">
                <ul>
                  <li>Скачать мод
                    <a href="https://greasyfork.org/ru/scripts/442316-private-stacking-script-leak" target="_blank">
                      <span class="yellow">Private stacking script leak</span>
                    </a> — 
                    <span class="pink">Укладка пуль при использовании хаков песочницы</span>
                  </li>
                </ul>
              </div>
            </div>
          </div>
        </section>
        <article>
          <?php
            include "../src/settings/game/game__nav.php";
          ?>
        </article>
        <article>
          <?php
            include "../src/settings/game/game__aside.php";
          ?>
        </article>
      </main>
      <footer>
        <?php
          include "../src/settings/game/game__footer.php";
        ?>
      </footer>
    </div>
    <?php
      include "../src/settings/game/game__script.php";
    ?>
  </body>
</html>