<!DOCTYPE html>
<html lang="ru">
  <head>
    <title>Играть Moomoo.io | WorldPlay</title>
    <?php
      include "../src/settings/game/game__head.php";
    ?>
  </head>
  <body>
    <?php
      include "../src/settings/preloader.php";
    ?>
    <div class="wrapper">
      <header>
        <?php
          include "../src/settings/game/game__header.php";
        ?>
      </header>
      <main>
        <section>
          <div class="play">
            <div class="play__container">
              <div class="play__item">
                <div class="play__value bpink" title="Оценка">
                  <p>8.3</p>
                </div>
                <div class="play__name">
                  <p>Moomoo.io</p>
                </div>
                <a href="../io/moomoo" target="_blank">
                  <?php
                    include "../src/settings/game/play_pink.php";
                  ?>
                </a>
              </div>
              <div class="play__blockcontainer">
                <div class="play__block">
                  <div class="play__iframe">
                    <iframe src="../io/moomoo"></iframe>
                  </div>
                </div>
                <div class="play__iogame">
                  <img src="https://cdn.worldplay.tk/cdn/images/icon_moomoo.io.webp" alt="" />
                  <ul>
                    <li><span class="pink">Разработчик:</span> Yendis Entertainment</li>
                    <li><span class="pink">Издатель:</span> Yendis Entertainment</li>
                    <li><span class="pink">Дата выпуска:</span> 9 марта 2017 г.</li>
                    <li><span class="pink">Жанры:</span> Экшен, Приключения</li>
                    <li><span class="pink">Платформы:</span> Браузер, Android</li>
                    <li><span class="pink">Режим игры:</span> Сетевая игра</li>
                    <li><span class="pink">Язык интерфейса:</span> Английский</li>
                    <li><span class="pink">Альтернативные названия:</span> moomooio, моомооио, мумуио, моо моо ио, моомоо ио, moo moo io, момо ио, момоио, муу муу ио</li>
                  </ul>
                </div>
              </div>
              <div class="play__content">
                <div class="play__info bpink">
                  <p>Об игре</p>
                </div>
                <div class="play__text">
                  <p>Moomoo.io — игра от разработчика таких игра как Drift.io и Bloble.io. Игра очень похожа на вышедшую позже Starve.io. Тут также нужно собирать ресурсы, строить поселение и защищаться от других игроков. Главное отличие Moomoo.io от Выживания — это отсутствие смены дня и ночи, а также необходимости постоянно пополнять свои силы - есть, греться и прочее. С одной стороны это делает игру Moomoo.io проще, с другой игра не становится менее интересной! А кто-то даже запишет в однозначные плюсы этой io-игры отсутствие усложняющих геймплей факторов. Эту игру называют по-разному, но самое смешное название Муу муу ио! И это наверное, самый крутой вариант произношения!</p>
                  <img src="https://cdn.worldplay.tk/cdn/game/moomoo.io.webp" alt="" />
                </div>
                <div class="play__info bpink">
                  <p>Как играть</p>
                </div>
                <div class="play__text">
                  <p>Ваша задача в Moomoo.io собирать ресурсы, разбросанные на карте, зарабатывать золото и построить поселение для защиты. По достижении второго уровня вам предстоит выбрать между топором и мечом. Первый позволяет добывать 2 единицы, второй наносит больший урон соперника. Здесь нужно решить какая роль вам больше по душе: добытчика или захватчика / защитника. Дальнейшие апгрейды касаются новых строений и апгрейдов существующих. В зависимости от выбранной роли в Moomoo.io имеет смысл выбирать определенные постройки и апгрейды.<br/>Золото = очки рейтинга. Получить очки рейтинга в Moomoo.io можно добывая золото в золотоносных шахтах или строя мельницы. Каждая мельница дает 1 золото за единицу времени. Продвинутая мельница дает 2 единицы золота. За пораженного соперника дают 10% от его запаса золота.<br/>Мельницы, очевидно, нужно защищать от мародеров и разбойников. Для этого стройте стены, шипы и прочие строения. Имеет смысл внутри поселения оставить дерево, куст с едой и даже каменную шахту, чтобы иметь возможность под защитой стен добывать ресурсы.<br/>В Moomoo.io есть животные. Некоторые из них мирные (свинья, корова), но быстро бегают, а некоторые агрессивны (бык, волк). Они тоже быстро бегают и очень сильно бьют. Для охоты на животных используются ловушки (Trap), дальнобойное оружие и шипы, которыми можно окружить животное и в которых оно медленно, но верно погибнет. И если волка можно сразить 1 на 1 при должном умении с первого уровня, то бык очень силён. Против него нужно использовать его неповоротливость. Так, если встать между двумя близко стоящими ресурсами, бык не сможет вас забодать и будет бродить вокруг. Вы тем временем можете прокачаться, добывая эти ресурсы, и потом уже одолеть зверя.<br/>Добывать золото в Moomoo.io очень полезно не только потому, что оно даёт очки рейтинга. За золото можно покупать Шапки (Hats) и Аксессуары. Некоторые из них пригодны только для веселья, некоторые послужат хорошей маскировкой, а некоторые серьезно помогут в игре, увеличивая ваши скорость, урон или повысят добычу ресурсов. Покупать эти вещи совершенно необходимо, особенно учитывая то, что, умерев, вы возрождаетесь абсолютно лишенный всех добытых ранее предметов и ресурсов.</p>
                </div>
                <div class="play__info bpink">
                  <p>Управление</p>
                </div>
                <div class="play__text">
                  <ul>
                    <li>Перемещение: WASD</li>
                    <li>Камера: мышкой</li>
                    <li>Выбор предмета: 1-9 или кликом на нужный</li>
                    <li>Рубить/Собирать/Атаковать: левый клик мышкой или пробел</li>
                    <li>Автосбор/атака: E</li>
                  </ul>
                </div>
                <div class="play__info bpink">
                  <p>Кланы</p>
                </div>
                <div class="play__text">
                  <p>Для удобства игры в команде в Moomoo.io ввели кланы. Члены кланов не наносят друг другу урон и на них не действую расставленные ловушки. Чтобы вступить, откройте меню кланов, нажав на кнопку. Далее перед вами появится таблица со списком кланов, в каждый из которых можно отправить заявку на вступление. Помните, что вашу заявку могут отклонить. При желании вы можете создать свой клан. Для этого там же вводите название клана и нажимаете Create (Создать). Теперь под кнопкой при поступлении заявок будет отображаться "принять" и "отклонить".</p>
                </div>
                <div class="play__info bpink">
                  <p>Песочница</p>
                </div>
                <div class="play__text">
                  <p>В Moomoo.io есть песочница, где нет ограничений на постройки и ресурсы, а значит можно проявить всю свою фантазию и изобретательность. Имейте в виду, что песочница давно не обновлялась + пользуется спросом (могут быть проблемы с тем, чтобы зайти на сервер). Кроме того, сервера песочницы добавлены в основной список серверов на стартовой странице игры. Долистайте до самого низа, до списка Experimental.</p>
                </div>
                <div class="play__info bpink">
                  <p>Рекомендации</p>
                </div>
                <div class="play__text">
                  <p>Собирайте как можно больше ресурсов, прежде, чем строить поселение. Постарайтесь находиться как можно ближе к деревне на случай, если кто-то решит вас атаковать. Если найти два источника ресурсов рядом друг с другом, можно добывать оба за один удар (и получать двойной опыт соответственно). Рекомендуем этот вариант для турбо-прокачки в Moomoo.io и получения ресурсов. С этой же целью можно построить каменную шахту рядом с деревом, кустом или золотоносной шахтой.</p>
                </div>
                <div class="play__info bpink">
                  <p>Моды</p>
                </div>
                <div class="play__text">
                  <ul>
                    <li>Скачать мод
                      <a href="https://greasyfork.org/ru/scripts/424066-pancake-mod-katana-musket-autoheal-anti-insta-starter-resources-and-more" target="_blank">
                        <span class="yellow">Pancake Mod</span>
                      </a> — 
                      <span class="pink">AUTOHEAL</span>,
                      <span class="green">Anti-Insta</span>,
                      <span class="pink">Anti-Ruby (Автоматическое противоядие)</span>,
                      <span class="green">Anti-Trap</span>,
                      <span class="pink">Autobreak Trap</span>,
                      <span class="green">Anti-Boost (-Spike)</span>
                    </li>
                    <li>Скачать мод
                      <a href="https://greasyfork.org/ru/scripts/437552-wasted-mod" target="_blank">
                        <span class="yellow">Wasted Mod</span>
                      </a> — 
                      <span class="pink">Улучшенное управление</span>
                    </li>
                  </ul>
                </div>
              </div>
            </div>
          </div>
        </section>
        <article>
          <?php
            include "../src/settings/game/game__nav.php";
          ?>
        </article>
        <article>
          <?php
            include "../src/settings/game/game__aside.php";
          ?>
        </article>
      </main>
      <footer>
        <?php
          include "../src/settings/game/game__footer.php";
        ?>
      </footer>
    </div>
    <?php
      include "../src/settings/game/game__script.php";
    ?>
  </body>
</html>