<!DOCTYPE html>
<html lang="ru">
  <head>
    <title>Играть Mope.io | WorldPlay</title>
    <?php
      include "../src/settings/game/game__head.php";
    ?>
  </head>
  <body>
    <?php
      include "../src/settings/preloader.php";
    ?>
    <div class="wrapper">
      <header>
        <?php
          include "../src/settings/game/game__header.php";
        ?>
      </header>
      <main>
        <section>
          <div class="play">
            <div class="play__container">
              <div class="play__item">
                <div class="play__value" title="Оценка">
                  <p>7.6</p>
                </div>
                <div class="play__name">
                  <p>Mope.io</p>
                </div>
                <a href="../io/mope" target="_blank">
                  <?php
                    include "../src/settings/game/play_white.php";
                  ?>
                </a>
              </div>
              <div class="play__blockcontainer">
                <div class="play__block">
                  <div class="play__iframe">
                    <iframe src="../io/surviv"></iframe>
                  </div>
                </div>
                <div class="play__iogame">
                  <img src="https://cdn.worldplay.tk/cdn/images/icon_mope.io.webp" alt="" />
                  <ul>
                    <li><span class="white">Разработчик:</span> Стэн Татарников</li>
                    <li><span class="white">Издатель:</span> Стэн Татарников, Krazy Koin Studios</li>
                    <li><span class="white">Дата выпуска:</span> 3 ноября 2016 г.</li>
                    <li><span class="white">Жанры:</span> Симулятор, Приключения</li>
                    <li><span class="white">Платформы:</span> Браузер, Android, Windows</li>
                    <li><span class="white">Режим игры:</span> Сетевая игра</li>
                    <li><span class="white">Язык интерфейса:</span> Русский</li>
                    <li><span class="white">Альтернативные названия:</span> mopeio, моп ио, море ио, мопи ио, кисла ио, киснут ио</li>
                  </ul>
                </div>
              </div>
              <div class="play__content">
                <div class="play__info">
                  <p>Об игре</p>
                </div>
                <div class="play__text">
                  <p>Mope.io — это игра, на мощных серверах которой живут единовременно по 15 тысяч игроков. Это делает Mope.io одной из самых популярных и посещаемых игр io жанра. Ко всем прочим регалиям, она является пионером io-игр в целом. По ее стопам пошли такие игры, как глубоководный Deeeep.io, занимательная бесиловка Creatur.io и много других. Для игроков в Mope.io есть десятки видов животных с уникальными особенностями, многие из которых к тому же секретные, а для описания всех нюансов игры потребуется второй Толстой — настолько игра насыщена и богата на взаимодействия.</p>
                  <img src="https://cdn.worldplay.tk/cdn/game/mope.io.webp" alt="" />
                </div>
                <div class="play__info">
                  <p>Как играть</p>
                </div>
                <div class="play__text">
                  <p>Основная задача в Mope io — прокачка до сильнейшего существа выбранного типа (земляной, водный) и также набор максимального количества очков. Многие отмечают, что начинается настоящая игра с того момента, когда максимальный уровень животного прокачан. Тем не менее создатели сделали так, что за каждое животное интересно играть и у каждого уровня есть уникальные навыки, которые помогают как охотиться, так и прятаться. Причем те животные, которых вы можете съесть, обведены светло-синим кругом, а те, что могут съесть вас — красным.<br/>Вода — то, без чего нельзя прожить в Mope.io. От голода здесь еще никто не умер, а вот обезвоживание убило немало игроков. По всей карте разбросаны синие колодцы с водой, да и просто синие круги воды, озёра, из которых можно попить. Также вода добывается из съеденных животных. Таким образом, охота приносит вам сразу и еду для роста и воду для выживания в мире Mope.io.<br/>На карте всегда много еды, но кушать вы можете только ту, что обведена светло-зеленым кругом. Сначала это красные точки (ягоды) для сухопутных или планктон для водных существ. С дальнейшими апгрейдами вам будут становиться доступны новые типы еды и закрываться некоторые старые.<br/>Начинается Mope.io с выбора типа животного — креветки или мыши. Это два базовых типа животных: земляные и водные. Если со временем вы переберетесь в арктическую область, то при следующем апгрейде животное превратится в "третий тип" — арктические существа, адаптированные под низкие температуры Севера. Могучее разнообразие животных в Mope.io послужило поводом для написания не одного Вики сайта, посвященного этой игре. Для англоговорящих доступна официальная страница разработчиков на Reddit.
Mope.io это одна из наиболее динамично развивающихся игр. Постоянно появляются новые животные, а у старых могут появляться новые навыки. Создатели следят за балансом в игре. Если получается так, что какое-то животное получается слишком сильным, его ослабляют. Если какое-то животное оказывается слабым и неспособным к конкуренции в жестоком мире Mope io, то его либо убирают вовсе, либо усиливают. Ветераны игры помнят животных, которые сгинули насовсем после неудачных вводов. Например, Лемминг. Как только появился мир Арктики, Лемминга заменили на Бурундука, а затем убрали и последнего, оставив его только лишь как игрового моба. В Mope.io все продумано.<br/>Учитывая то, что на сервер заходят игроки со всего земного шара, то можно смело предполагать, что и ночью там будет с кем поиграть. Mope.io это еще и развитое сообщество, множество ютуб — обозревателей на основных языках мира. Радость игроков не только в самой игре, но и в активном обсуждении игрового процесса, сочинение фан-арта и прочих сопутствующих материалов.</p>
                </div>
                <div class="play__info">
                  <p>Управление</p>
                </div>
                <div class="play__text spacebetween">
                  <ul>
                    <li>Животное двигается за мышью</li>
                    <li>Пробел или двойной клик чтобы сделать рывок вперед</li>
                    <li>W чтобы нырнуть под воду</li>
                    <li>Enter чтобы открыть чат</li>
                  </ul>
                </div>
              </div>
            </div>
          </div>
        </section>
        <article>
          <?php
            include "../src/settings/game/game__nav.php";
          ?>
        </article>
        <article>
          <?php
            include "../src/settings/game/game__aside.php";
          ?>
        </article>
      </main>
      <footer>
        <?php
          include "../src/settings/game/game__footer.php";
        ?>
      </footer>
    </div>
    <?php
      include "../src/settings/game/game__script.php";
    ?>
  </body>
</html>