<!DOCTYPE html>
<html lang="ru">
  <head>
    <title>Играть Starve.io | WorldPlay</title>
    <?php
      include "../src/settings/game/game__head.php";
    ?>
  </head>
  <body>
    <?php
      include "../src/settings/preloader.php";
    ?>
    <div class="wrapper">
      <header>
        <?php
          include "../src/settings/game/game__header.php";
        ?>
      </header>
      <main>
        <section>
          <div class="play">
            <div class="play__container">
              <div class="play__item">
                <div class="play__value bpink" title="Оценка">
                  <p>8.8</p>
                </div>
                <div class="play__name">
                  <p>Starve.io</p>
                </div>
                <a href="../io/starve" target="_blank">
                  <?php
                    include "../src/settings/game/play_pink.php";
                  ?>
                </a>
              </div>
              <div class="play__blockcontainer">
                <div class="play__block">
                  <div class="play__iframe">
                    <iframe src="../io/starve"></iframe>
                  </div>
                </div>
                <div class="play__iogame">
                  <img src="https://cdn.worldplay.tk/cdn/images/icon_starve.io.webp" alt="" />
                  <ul>
                    <li><span class="pink">Разработчик:</span> Неизвестно</li>
                    <li><span class="pink">Издатель:</span> Неизвестно</li>
                    <li><span class="pink">Дата выпуска:</span> Неизвестно</li>
                    <li><span class="pink">Жанры:</span> Песочница</li>
                    <li><span class="pink">Платформы:</span> Браузер</li>
                    <li><span class="pink">Режим игры:</span> Сетевая игра</li>
                    <li><span class="pink">Язык интерфейса:</span> Английский</li>
                    <li><span class="pink">Альтернативные названия:</span> старв ио, старвио, голод ио, старва ио, игра голод ио</li>
                  </ul>
                </div>
              </div>
              <div class="play__content">
                <div class="play__info bpink">
                  <p>Об игре</p>
                </div>
                <div class="play__text">
                  <p>Starve.io — выжить в лесу, борясь с холодом и голодом! Это совершенно новая, совершенно непохожая ни на одну из известных вам игр io-игра от создателей игры Limax.io и Oib.io. Хочется отметить, что разработчики игры уделяют особое внимание геймплею, не просто плодя похожие друг на друга io-игры, а стараясь сделать их интересным и оригинальными. Если вы играли в Minecraft, то разберись в правилах Starve.io очень быстро.<br/>Многие отметили, что Starve.io похожа на вышедшую ранее Moomoo.io, и даже обвинили в плагиате. Однако не стоит торопиться с выводами. Разработка любой игры — процесс длительный. И то, что две игры оказались слегка похожи друг на друга, это исключитель показатель того, что одинаковые мысли порой приходят одновременно. Прежде всего, игра Starve.io максимально усложнена. Во-первых, вы не можете просто беззаботно существовать, ваши показатели при бездействии стремительно падают. Во-вторых, все становится еще хуже с наступлением ночи.</p>
                  <img src="https://cdn.worldplay.tk/cdn/game/starve.io.webp" alt="" />
                </div>
                <div class="play__info bpink">
                  <p>Как играть</p>
                </div>
                <div class="play__text">
                  <p>Обратите внимание на новое обновление в Starve.io от 5 июля! Добавился новый биом МОРЕ + локации ОЗЕРА, а также множество новых крафтов и животных: Пиранье, Пшеница, Торты и пр.<br/>Давайте разберемся как играть в Starve.io. Вы появляетесь в лесу. Ваша задача — выжить. Вокруг вас то ли соратники, то ли противники. Каждый занят спасением собственной шкуры и в общем-то обращает на других мало внимания. Ничего не напоминает?! Да это же голодные игры! Не хватает разве что козней со стороны наблюдателей, чтобы жизнь не казалось такой прекрасной. Впрочем, в Starve.io и без этого проблем хватает.
Обращать внимание нужно на 3 момента: <b>Жизнь, Голод и Холод.</b></p>
                </div>
                <div class="play__info bpink">
                  <p>Еда / Тепло / Здоровье</p>
                </div>
                <div class="play__text">
                  <p>Для повышения уровня сытости в Starve.io нужно питаться. Существует два вида пищи ягоды и мясо. Ягоды добываются с ягодных деревьев, мясо из кроликов и волков. Мясо можно пожарить рядом с костром. Жареное мясо восстанавливает сытость до 100%. Ягодных кустов как водится на всех не хватает, поэтому вы можете их высадить. Чтобы прорастить саженец потребуется костер, дерево и ягоды. Саженец прорастает приблизительно за сутки.<br/>Для повышения уровня тепла нужно греться. Для этого можно скрафтить огонь. Особая подстава заключается в том, что день сменяется ночью, а ночью без костра не выжить никак. Нужно либо скрафтить костер, либо найти уже существующий. Как правило, соперники больше озабочены своим выживанием и не обращают внимание на пришельцев.<br/>Уровень жизни снижается как только уровень сытости или тепла падает до нуля. При ненулевых значениях жизнь постепенно восстанавливается.<br/>Для автоматического подкрепления при снижении уровня сытости можно использовать авто-питание. Активируется по кнопке R.</p>
                </div>
                <div class="play__info bpink">
                  <p>Ресурсы / Инструменты / Оружие / Объекты</p>
                </div>
                <div class="play__text">
                  <p>Майнить ресурсы в Starve.io придется все время. В самом начале, без инструментов, вы можете добывать только дерево. Потом скрафтив деревянную кирку (15 дерева), можно добывать камень. Дальше крафтим каменную кирку и можем добывать золото и т.д.<br/>Помимо кирки в Starve.io можно скрафтить оружие (меч) и отгонять им от своих владений прочих игроков. Не зря же вы высаживали все эти деревья! Меч также можно менять с каменного на золотой и так далее.<br/>Помимо уже упомянутого Костра можно строить укрепления. Для этого потребуется скрафтить верстак, он будет основой вашего поселения. После этого появляются дополнительные возможности.</p>
                </div>
                <div class="play__info bpink">
                  <p>Рекомендации</p>
                </div>
                <div class="play__text">
                  <p>Лучше всего в игру Starve.io играть на весь экран. Для этого нажмите зеленую кнопку "На весь экран" справа от окна с игрой или кнопку в углу в самом окне. Для пущего эффекта вы можете перейти в полноэкранный режим браузера, нажав F11. Выйти из этого режима можно также, нажав F11.<br/>Starve.io игра жесткая, но именно таким и является дикий мир, где выживает только ловкий и сильный. Можно ли в Starve.io играть в команде? Не только можно, но и нужно. Фактически игра в команде является наиболее эффективным способом выживания, как в игре, так и в жизни. Пробуйте, комбинируйте, объединяйтесь и выйдите победителем!</p>
                </div>
              </div>
            </div>
          </div>
        </section>
        <article>
          <?php
            include "../src/settings/game/game__nav.php";
          ?>
        </article>
        <article>
          <?php
            include "../src/settings/game/game__aside.php";
          ?>
        </article>
      </main>
      <footer>
        <?php
          include "../src/settings/game/game__footer.php";
        ?>
      </footer>
    </div>
    <?php
      include "../src/settings/game/game__script.php";
    ?>
  </body>
</html>